     A*===============================================================
     A* Ficheiro...: FAUDP10001
     A* Descrição..: Controlo de Operações Sobre as Apólices
     A*===============================================================
     A          R RAUDP100                  PFILE(FAUDP100)
     A
     A          K CDUSER
     A          K NOMJOB
     A          K NUMJOB
