     A***************************************************************
     A* Tabela....: FCATP10701
     A* Descrição.:
     A***************************************************************
     A          R RCATP107                  PFILE(FCATP107)
     A
     A          K CDPROD
     A          K CDCOBERT
     A          K CDDOCUM
     A          K NUORDEM
