     A***************************************************************
     A* Tabela....: FCATP10101
     A* Descrição.: Aliases
     A***************************************************************
     A          R RCATP101                  PFILE(FCATP101)
     A
     A          K CDPROD
     A          K ALIAS
