     A                                      UNIQUE
     A          R RCATP010
     A            CODINDICE      3S 0
     A            ANO            4P 0
     A            TRIMESTRE      1P 0
     A            INCIDENCIA     1A
     A            VALOR          6P 2
     A            DESCRICAO     40A
     A            CAT01001        L
     A            CAT01002        L
     A
     A          K CODINDICE
