     A***************************************************************
     A* Tabela....: FCATP10001
     A* Descrição.:
     A***************************************************************
     A          R RCATP100                  PFILE(FCATP100)
     A
     A          K CDRAMO
     A          K CDVARIA
