     A*===============================================================
     A* Ficheiro...: FCATP118
     A* Descrição..:
     A*===============================================================
     A          R RCATP118                  PFILE(FCATP118)
     A
     A          K CDPROD
     A          K CDFUNCT
