     A***************************************************************
     A* Tabela....: FCATP10201
     A* Descrição.: Aliases
     A***************************************************************
     A          R RCATP102                  PFILE(FCATP102)
     A
     A          K CDPROD
     A          K CDSUPER
