     A*===============================================================
     A* Ficheiro...: FCATP20001
     A* Descrição..: Ordenada por Chave Original
     A*===============================================================
     A          R RCATP200                  PFILE(FCATP200)
     A
     A          K CCOMP
     A          K CDCHVOR
