     A*===============================================================
     A* Ficheiro...: FCOBP01001
     A* Descrição..: Ficheiros Registados
     A*===============================================================
     A          R RCOBP010                  PFILE(FCOBP010)
     A
     A          K TPENTID
     A          K NUORDEM
