     A*===============================================================
     A* Ficheiro...: FCOBP01001
     A* Descrição..: Ficheiros Registados
     A*===============================================================
     A          R FCOBP010                  PFILE("fcobp010")
     A
     A          K TPENTID
     A          K NUORDEM
