     A                                      UNIQUE
     A          R RCOBP012
     A            NUMRECIBO     10S 0
     A            SEQUENCIA     10S 0
     A            CODCOBERT      4A
     A            VALCOBERT      9S 2
     A            DATREGISTO      L
     A            ESTADO         3A
     A            DATESTADO       L
     A
     A          K NUMRECIBO
     A          K SEQUENCIA
