     A***************************************************************
     A* Tabela....: FDOCP01601
     A* Descrição.: Lógico por Sequencia
     A***************************************************************
     A          R RDOCP016                  PFILE(FDOCP016)
     A
     A          K SEQSERVER
