     A***************************************************************
     A* Tabela....: FDOCP01501
     A* Descrição.: Lógico por código de Documento
     A***************************************************************
     A          R RDOCP015                  PFILE(FDOCP015)
     A
     A          K NOMDOC
