     A*==============================================================
     A* Ficheiro..: FDOCP03001
     A* Objectivo.: Ordenação pelo nome da Template
     A*==============================================================
     A          R RDOCP030                  PFILE(FDOCP030)
     A
     A          K NOME
