     A          R RDOCP061
     A
     A            CDCARTA        4A
     A            NULINHA        4S 0
     A            TEXTO         60A
     A
     A          K CDCARTA
     A          K NULINHA
