     A*===============================================================
     A* Ficheiro...: FDOCP06001
     A* Descrição..: Utilizado pelo MySQL (IBMDB2i)
     A*===============================================================
     A          R RDOCP060                  PFILE(FDOCP060)
     A
     A          K NCV
     A          K ANNCV
