     A*===============================================================
     A* Ficheiro...: FENTP00101
     A* Descrição..: Mestre de Entidades - Ordenação por NIF
     A*===============================================================
     A          R RENTP001                  PFILE(FENTP001)
     A
     A          K NUNIF
