     A*===============================================================
     A* Ficheiro...: FENTP01001
     A* Descrição..: Ficheiros Registados
     A*===============================================================
     A          R RENTP010                  PFILE(FENTP010)
     A
     A          K NUNIF
     A          K DTINICIO
