     A***************************************************************
     A* Tabela....: FGRLP02001
     A* Descrição.: Biblioteca e Ficheiros de Input
     A***************************************************************
     A          R RGRLP020                  PFILE(FGRLP020)
     A
     A          K CDGRUPO
     A          K CDLETRA
     A          K ANOMES
