     A***************************************************************
     A* Tabela....: FGRLP02301
     A* Descrição.: Biblioteca e Ficheiros de Input
     A***************************************************************
     A          R RGRLP026                  PFILE(FGRLP026)
     A
     A          K VALFIELD
     A          K CDFIELD
