     A*================================================================
     A* Tabela....: FGRLP20201
     A* Descrição.: Servidores FTP
     A*================================================================
     A          R RGRLP202                  PFILE(FGRLP202)
     A
     A          K NMSOPER
