     A***************************************************************
     A* Tabela....: FGRLP02301
     A* Descrição.: Biblioteca e Ficheiros de Input
     A***************************************************************
     A          R RGRLP023                  PFILE(FGRLP023)
     A
     A          K DTCRIA
     A          K HRCRIA
