     A*===============================================================
     A* Ficheiro...: FINTP02001
     A* Descrição..: Ficheiros Registados
     A*===============================================================
     A          R RINTP020                  PFILE(FINTP020)
     A
     A          K NOFILE
