     A*===============================================================
     A* Ficheiro...: FINTP05801
     A* Descrição..: Interfaces Gerados no Processo
     A*===============================================================
     A          R RINTP058                  PFILE(FINTP058)
     A
     A          K CDPROCE
     A          K CDMEDIA
