     A*===============================================================
     A* Ficheiro...: FINTP02501
     A* Descrição..: Recibos extraídos
     A*===============================================================
     A          R RINTP025                  PFILE(FINTP025)
     A
     A          K CDREGIS
