     A*===============================================================
     A* Ficheiro...: FINTP01001
     A* Descrição..: Ficheiros Registados
     A*===============================================================
     A          R RINTP010                  PFILE(FINTP010)
     A
     A          K NOMFILE
