     A*===============================================================
     A* Ficheiro...: FINTP02701
     A* Descrição..: Relação com os Ficheiros de Interface
     A*===============================================================
     A          R RINTP027                  PFILE(FINTP027)
     A
     A          K CDREGIS
