     A*===============================================================
     A* Ficheiro...: FINTP02801
     A* Descrição..: Recibos extraídos
     A*===============================================================
     A          R RINTP028                  PFILE(FINTP028)
     A
     A          K CCOMP
     A          K CDRMORG
     A          K NUAPOLOR
     A          K NUMRECOR
