     A***************************************************************
     A* Tabela....: FINTP00201
     A* Descrição.: Ordenado por Processo Batch
     A***************************************************************
     A          R RINTP002                  PFILE(FINTP002)
     A
     A          K CDBATCH
