     A*===============================================================
     A* Ficheiro...: FINTP01301
     A* Descrição..: Registos de NIF'S Inválidos
     A*===============================================================
     A          R RINTP013                  PFILE(FINTP013)
     A
     A          K NUMNIF
