     A*===============================================================
     A* Ficheiro...: FINTP05601
     A* Descrição..: Ficheiros temporários processados
     A*===============================================================
     A          R RINTP056                  PFILE(FINTP056)
     A
     A          K CDBATCH
     A          K CDFILE
