     A***************************************************************
     A* Tabela....: FPRDP10101
     A* Descrição.: Lógico de Indices
     A***************************************************************
     A          R RPRDP101                  PFILE(FPRDP101)
     A
     A          K CONTADOR
