     A*===============================================================
     A* Ficheiro.: FPRDP12001
     A* Descrição: Apólices seleccionadas para Indexação.
     A*
     A*===============================================================
     A          R RPRDP120                  PFILE(FPRDP120)
     A
     A          K ANOIDX
     A          K MESIDX
