     A***************************************************************
     A* Tabela....: FPRDP01401
     A* Descrição.: Ordenado por Código de Limite
     A***************************************************************
     A          R RPRDP014                  PFILE(FPRDP014)
     A
     A          K CDRAMO
     A          K NUAPOL
     A          K CDLIMITE
