     A***************************************************************
     A* Tabela....: FPRDP00801
     A* Descrição.: Ordenado por Código de Cobertura
     A***************************************************************
     A          R RPRDP008                  PFILE(FPRDP008)
     A
     A          K CDRAMO
     A          K NUAPOL
     A          K CDCOBERT
