     A***************************************************************
     A* Tabela....: FPRDP01001
     A* Descrição.: Ordenado por Código de Texto
     A***************************************************************
     A          R RPRDP010                  PFILE(FPRDP010)
     A
     A          K CDRAMO
     A          K NUAPOL
     A          K NUSQSUP
