     A*===============================================================
     A* Ficheiro.: FPRDP12201
     A* Descrição: Apólices seleccionadas para Indexação.
     A*
     A*===============================================================
     A          R RPRDP122                  PFILE(FPRDP122)
     A
     A          K CODIDX
     A          K CDRAMO
     A          K NUAPOL
