     A***************************************************************
     A* Tabela....: FRECT01002
     A* Descrição.: Ordenado por Mediador com Cobrança
     A***************************************************************
     A          R RRECT010                  PFILE(FRECT010)
     A
     A          K CC0
     A          K NNUMREC
