     A***************************************************************
     A* Tabela....: FRECT01001
     A* Descrição.: Ordenado por número de Recibo
     A***************************************************************
     A          R RRECT010                  PFILE(FRECT010)
     A
     A          K NNUMREC
