     A*===============================================================
     A* Ficheiro...: FPRTP003
     A* Descrição..: Relação dos Contratos Seleccionados
     A*===============================================================
     A          R RRPTP003                  PFILE(FRPTP003)
     A
     A          K CDREPORT
     A          K NUPERIOD
     A          K CDRAMO
     A          K NUAPOL
