     A***************************************************************
     A* Tabela....: FSECP07001
     A* Descrição.: Ordenação por Função
     A***************************************************************
     A          R RSECP070                  PFILE(FSECP070)
     A
     A          K NOBATCH
