     A***************************************************************
     A* Tabela....: FSECP01401
     A* Descrição.: Definição de Menus
     A***************************************************************
     A          R RSECP014                  PFILE(FSECP014)
     A
     A          K CMITEM
