     A***************************************************************
     A* Tabela....: FSECP07101
     A* Descrição.: Ordenação por Função
     A***************************************************************
     A          R RSECP071                  PFILE(FSECP071)
     A
     A          K CDBATCH
     A          K CDPROGR
