     A***************************************************************
     A* Tabela....: FSECP01001
     A* Descrição.: Ordenação por comando
     A***************************************************************
     A          R RSECP010                  PFILE(FSECP010)
     A
     A          K NOFRAME
