     A***************************************************************
     A* Tabela....: FSECP01003
     A* Descrição.: Ordenação por Função
     A***************************************************************
     A          R RSECP010                  PFILE(FSECP010)
     A
     A          K NMPROGR
