     A***************************************************************
     A* Tabela....: FSECP015
     A* Descrição.: Bilbioteca
     A***************************************************************
     A                                      UNIQUE
     A          R RSECP015
     A            CDLIBL         5S 0       TEXT('Código da Lista')
     A            DSLIBL       100A         TEXT('Descrição da Lista')
     A
     A          K CDLIBL
