     A***************************************************************
     A* Tabela....: FSECP03101
     A* Descrição.: Lógico de SSID
     A***************************************************************
     A          R RSECP031                  PFILE(FSECP031)
     A
     A          K IP
