     A***************************************************************
     A* Tabela....: FSINP11401
     A* Descrição.: Ordenado pelas chaves do MS Access
     A***************************************************************
     A          R RSINP114                  PFILE(FSINP114)
     A
     A          K AAPROC
     A          K NUPROC
     A          K MSTPINT
     A          K MSSQINT
     A          K MSTPSIN
