     A***************************************************************
     A* Tabela....: FSINP10301
     A* Descrição.: Intervinientes_DM por processo
     A***************************************************************
     A          R RSINP103                  PFILE(FSINP103)
     A
     A          K NRPROC
     A          K NORDEM
