     A***************************************************************
     A* Tabela....: FTBLP01301
     A* Descrição.: Ordenado por Alias e Tipo
     A*
     A***************************************************************
     A          R RTBLP013                  PFILE(FTBLP013)
     A
     A          K ALIAS
     A          K CDSUPER
