     H ALWNULL(*USRCTL)  BNDDIR('JMDIR') DFTACTGRP(*NO) ACTGRP(*CALLER)
     H AUT(*ALL)
     H*==================================================================
     H* Programa..: PENTO002
     H* Descrição.: Actualizar informação
     H*==================================================================
     F
      /FREE
         *INLR = *ON;
         RETURN;
      /END-FREE
