     H PGMINFO(*PCML:*MODULE)
     D WVar01          S             10A
     D*==================================================================
     C     *ENTRY        PLIST
     C                   PARM                    WVar01
     C
     C                   EVAL      WVar01 = 'O que vai apa'
     C
     C                   RETURN
     C                   SETON                                        LR
