     H DFTNAME(GP015)
     FECRAN     CP   F  768        WORKSTN
     F                                     FMTS(GP015F)
     IECRAN
     I* FORMAT-INPUT1
     I                                  1    1  INDREG
     I                                  2    6 0NSEG
     I* FORMAT-INPUT
     I                                  1    1  INDREG
     I                                  2   41  LCB
     I                                 42   45 0CPOSL
     I                                 46   48 0ZPOSL
     I                                 49   68  CPLCB2
     I                                 69   69 0SIT
     I                                 70   71 0DDINIC
     I                                 72   73 0MMINIC
     I                                 74   77 0AAINIC
     I                                 78   78 0DUR
     I                                 79   80 0DDFIM
     I                                 81   82 0MMFIM
     I                                 83   86 0AAFIM
     I                                 87   87 0IM
     I                                 88   88 0FRAC
     I                                 89   90 0MES1
     I                                 91   92 0MMCONT
     I                                 93   96 0AACONT
     I                                 97   97 0CEMIS
     I                                 98   98 0ISEN
     I                                 99  101 0CONC
     I                                102  106 0CRHIP
     I                                107  109 0MED1
     I                                110  111 0COM1
     I                                112  114 0COM1
     I                                115  119 0MED2
     I                                120  121 0COM2
     I                                122  124 0COM2
     I                                125  125  EMPREG
     I                                126  129 0ANOEDI
     I                                130  130  AVISN
     I                                131  134 0CPEDI
     I                                135  135 0CR1
     I                                136  146 0CAP1
     I                                147  151 0TX1
     I                                152  158 0PR1
     I                                159  160 0PR1
     I                                161  161 0CS
     I                                162  162 0CR2
     I                                163  173 0CAP2
     I                                174  178 0TX2
     I                                179  185 0PR2
     I                                186  187 0PR2
     I                                188  188 0CR3
     I                                189  199 0CAP3
     I                                200  204 0TX3
     I                                205  211 0PR3
     I                                212  213 0PR3
     I                                214  224 0CAPTOT
     I                                225  229 0TXMED
     I                                230  236 0PRCACT
     I                                237  238 0PRCACT
     I                                239  245 0FRANQO
     I                                246  256 0CAPFAT
     I                                257  267 0ADC
     I                                268  288  NIB
     I                                289  333  LRPS
     I                                334  336 0TXIND
     I                                337  337  INDEX
     I                                338  340 0TXSNB
     I                                341  344 0NASC
     I                                345  347 0PROFSL
     I                                348  348 0CGRUPO
     I                                349  353 0NPESS
     I                                354  354  RA
     I                                355  384  NATUR
     I                                385  385  CLASS
     I                                386  386  PERDCQ
     I                                387  387  TPERD
     I                                388  389 0PPERDI
     I                                390  398 0ENCFIX
     I                                399  400 0PINDMN
     I                                401  402 0CL01
     I                                403  404 0CL02
     I                                405  406 0CL03
     I                                407  408 0CL04
     I                                409  410 0CL05
     I                                411  412 0CL06
     I                                413  415 0PFRC
     I                                416  416  MOD
     I                                417  417  TPP
     I                                418  423 0CAE
     I                                424  426 0JMM1
     I                                427  431 0JMC1
     I                                432  476  OBS1
     I                                477  479 0JMM2
     I                                480  484 0JMC2
     I                                485  529  OBS2
     I* FORMAT-OUTPUT
     I                                  1    1  INDREG
     I                                  2   41  LCB
     I                                 42   45 0CPOSL
     I                                 46   48 0ZPOSL
     I                                 49   68  CPLCB2
     I                                 69   69 0SIT
     I                                 70   71 0DDINIC
     I                                 72   73 0MMINIC
     I                                 74   77 0AAINIC
     I                                 78   78 0DUR
     I                                 79   80 0DDFIM
     I                                 81   82 0MMFIM
     I                                 83   86 0AAFIM
     I                                 87   87 0IM
     I                                 88   88 0FRAC
     I                                 89   90 0MES1
     I                                 91   92 0MMCONT
     I                                 93   96 0AACONT
     I                                 97   97 0CEMIS
     I                                 98   98 0ISEN
     I                                 99  101 0CONC
     I                                102  106 0CRHIP
     I                                107  109 0MED1
     I                                110  111 0COM1
     I                                112  114 0COM1
     I                                115  119 0MED2
     I                                120  121 0COM2
     I                                122  124 0COM2
     I                                125  125  EMPREG
     I                                126  129 0ANOEDI
     I                                130  130 0TALT
     I                                131  132 0DDALT
     I                                133  134 0MMALT
     I                                135  138 0AAALT
     I                                139  140 0MALT
     I                                141  143 0ACTA
     I                                144  144  AVISN
     I                                145  148 0CPEDI
     I                                149  149 0CR1
     I                                150  160 0CAP1
     I                                161  165 0TX1
     I                                166  172 0PR1
     I                                173  174 0PR1
     I                                175  175 0CS
     I                                176  182 0PRCANT
     I                                183  184 0PRCANT
     I                                185  185 0CR2
     I                                186  196 0CAP2
     I                                197  201 0TX2
     I                                202  208 0PR2
     I                                209  210 0PR2
     I                                211  211 0CR3
     I                                212  222 0CAP3
     I                                223  227 0TX3
     I                                228  234 0PR3
     I                                235  236 0PR3
     I                                237  247 0CAPTOT
     I                                248  252 0TXMED
     I                                253  259 0PRCACT
     I                                260  261 0PRCANT
     I                                262  268 0FRANQO
     I                                269  279 0CAPFAT
     I                                280  290 0ADC
     I                                291  311  NIB
     I                                312  356  LRPS
     I                                357  359 0TXIND
     I                                360  360  INDEX
     I                                361  363 0TXSNB
     I                                364  367 0NASC
     I                                368  370 0PROFSL
     I                                371  371 0CGRUPO
     I                                372  376 0NPESS
     I                                377  377  RA
     I                                378  407  NATUR
     I                                408  408  CLASS
     I                                409  409  PERDCQ
     I                                410  410  TPERD
     I                                411  412 0PPERDI
     I                                413  421 0ENCFIX
     I                                422  423 0PINDMN
     I                                424  425 0CL01
     I                                426  427 0CL02
     I                                428  429 0CL03
     I                                430  431 0CL04
     I                                432  433 0CL05
     I                                434  435 0CL06
     I                                436  438 0PFRC
     I                                439  439 0TEST
     I                                440  442 0TXEST
     I                                443  443  MOD
     I                                444  444  TPP
     I                                445  450 0CAE
     I                                451  453 0JMM1
     I                                454  458 0JMC1
     I                                459  503  OBS1
     I                                504  506 0JMM2
     I                                507  511 0JMC2
     I                                512  556  OBS2
     I                                557  563 0TOTREC
     I                                564  565 0TOTREC
     I* FORMAT-ECERRO
     I                                  1    1  INDREG
     I* FORMAT-CONDOM
     I                                  1    1
     I                                  2    4  SIMNAO
     OECRAN     D
     O                                           K8 'INPUT1  '
     O                       INDREG               1
     O                       RSALDO              26
     O                       WOPCAO              34
     O                       RRAPOL              43
     O                       REF                 44
     O                       NSEG                49
     O                       SEG                 89
     O                       MOR                129
     O                       CPOSM              133
     O                       ZPOSM              136
     O                       CPMOR2             156
     OECRAN     D
     O                                           K8 'INPUT   '
     O                       INDREG               1
     O                       LCB                 41
     O                       CPOSL               45
     O                       ZPOSL               48
     O                       CPLCB2              68
     O                       SIT                 69
     O                       DDINIC              71
     O                       MMINIC              73
     O                       AAINIC              77
     O                       DUR                 78
     O                       DDFIM               80
     O                       MMFIM               82
     O                       AAFIM               86
     O                       IM                  87
     O                       FRAC                88
     O                       MES1                90
     O                       MMCONT              92
     O                       AACONT              96
     O                       CEMIS               97
     O                       EXCONT              98
     O                       ISEN                99
     O                       CONC               102
     O                       CRHIP              107
     O                       DSCRHI             147
     O                       MED1               150
     O                       COM1               152
     O                       COM1               155
     O                       MED2               160
     O                       COM2               162
     O                       COM2               165
     O                       EMPREG             166
     O                       ANOEDI             170
     O                       TALT               171
     O                       DDALT              173
     O                       MMALT              175
     O                       AAALT              179
     O                       MALT               181
     O                       ACTA               184
     O                       AVISN              185
     O                       CPEDI              189
     O                       CR1                190
     O                       CAP1               201
     O                       TX1                206
     O                       PR1                213
     O                       PR1                215
     O                       CS                 216
     O                       PRCANT             223
     O                       PRCANT             225
     O                       CR2                226
     O                       CAP2               237
     O                       TX2                242
     O                       PR2                249
     O                       PR2                251
     O                       CR3                252
     O                       CAP3               263
     O                       TX3                268
     O                       PR3                275
     O                       PR3                277
     O                       CAPTOT             288
     O                       TXMED              293
     O                       PRCACT             300
     O                       PRCACT             302
     O                       FRANQO             309
     O                       PRIANT             314
     O                       PRIANT             316
     O                       CAPFAT             327
     O                       ADC                338
     O                       NIB                359
     O                       LRPS               404
     O                       TXIND              407
     O                       INDEX              408
     O                       TXSNB              411
     O                       NASC               415
     O                       PROFSL             418
     O                       CGRUPO             419
     O                       NPESS              424
     O                       RA                 425
     O                       NATUR              455
     O                       CLASS              456
     O                       PERDCQ             457
     O                       TPERD              458
     O                       PPERDI             460
     O                       ENCFIX             469
     O                       PINDMN             471
     O                       CL01               473
     O                       CL02               475
     O                       CL03               477
     O                       CL04               479
     O                       CL05               481
     O                       CL06               483
     O                       PFRC               486
     O                       TEST               487
     O                       TXEST              490
     O                       MOD                491
     O                       TPP                492
     O                       CAE                498
     O                       JMM1               501
     O                       JMC1               506
     O                       OBS1               551
     O                       JMM2               554
     O                       JMC2               559
     O                       OBS2               604
     O                       TOTREC             611
     O                       TOTREC             613
     OECRAN     D
     O                                           K8 'OUTPUT  '
     O                       INDREG               1
     O                       WOPCAO               9
     O                       RRAPOL              18
     O                       REF                 19
     O                       NSEG                24
     O                       SEG                 64
     O                       RSALDO              89
     O                       MOR                129
     O                       CPOSM              133
     O                       ZPOSM              136
     O                       CPMOR2             156
     O                       LCB                196
     O                       CPOSL              200
     O                       ZPOSL              203
     O                       CPLCB2             223
     O                       SIT                224
     O                       DDINIC             226
     O                       MMINIC             228
     O                       AAINIC             232
     O                       DUR                233
     O                       DDFIM              235
     O                       MMFIM              237
     O                       AAFIM              241
     O                       IM                 242
     O                       FRAC               243
     O                       MES1               245
     O                       MMCONT             247
     O                       AACONT             251
     O                       CEMIS              252
     O                       EXCONT             253
     O                       ISEN               254
     O                       CONC               257
     O                       CRHIP              262
     O                       DSCCRH             302
     O                       MED1               305
     O                       COM1               307
     O                       COM1               310
     O                       MED2               315
     O                       COM2               317
     O                       COM2               320
     O                       EMPREG             321
     O                       ANOEDI             325
     O                       TALT               326
     O                       DDALT              328
     O                       MMALT              330
     O                       AAALT              334
     O                       MALT               336
     O                       ACTA               339
     O                       AVISN              340
     O                       CPEDI              344
     O                       CR1                345
     O                       CAP1               356
     O                       TX1                361
     O                       PR1                368
     O                       PR1                370
     O                       CS                 371
     O                       PRCANT             378
     O                       PRCANT             380
     O                       CR2                381
     O                       CAP2               392
     O                       TX2                397
     O                       PR2                404
     O                       PR2                406
     O                       CR3                407
     O                       CAP3               418
     O                       TX3                423
     O                       PR3                430
     O                       PR3                432
     O                       CAPTOT             443
     O                       TXMED              448
     O                       PRCACT             455
     O                       PRCANT             457
     O                       FRANQO             464
     O                       PRIANT             469
     O                       PRIANT             471
     O                       CAPFAT             482
     O                       ADC                493
     O                       NIB                514
     O                       LRPS               559
     O                       TXIND              562
     O                       INDEX              563
     O                       TXSNB              566
     O                       NASC               570
     O                       PROFSL             573
     O                       CGRUPO             574
     O                       NPESS              579
     O                       RA                 580
     O                       NATUR              610
     O                       CLASS              611
     O                       PERDCQ             612
     O                       TPERD              613
     O                       PPERDI             615
     O                       ENCFIX             624
     O                       PINDMN             626
     O                       CL01               628
     O                       CL02               630
     O                       CL03               632
     O                       CL04               634
     O                       CL05               636
     O                       CL06               638
     O                       PFRC               641
     O                       TEST               642
     O                       TXEST              645
     O                       MOD                646
     O                       TPP                647
     O                       CAE                653
     O                       JMM1               656
     O                       JMC1               661
     O                       OBS1               706
     O                       JMM2               709
     O                       JMC2               714
     O                       OBS2               759
     O                       TOTREC             766
     O                       TOTREC             768
     OECRAN     D
     O                                           K8 'ECERRO  '
     O                       INDREG               1
     O                       MENSER              61
     OECRAN     D
     O                                           K8 'ECMENS  '
     O                       MENSER              60
     OECRAN     D
     O                                           K8 'CONDOM  '
     O                       SIMNAO               3
