     D*=======================================================
     D* Dat.Cria...: 2012-05-01
     D* Autor......: Luis Galhoz
     D* Biblioteca.: SPRDO002
     D* Objectivo..:
     D*=======================================================
     D*==> Parametros recebidos
     D WRamo           S              2S 0
     D WApolice        S              7S 0
     D WDatInicio      S              8S 0
     D WpLinhasTxt     S               *
