       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.

       PROGRAM-BEGIN.
           DISPLAY "HELLO WORLD".
           DISPLAY "HELLO WORLD".
           DISPLAY "HELLO WORLD".

       PROGRAM-DONE.
           STOP RUN.
