       IDENTIFICATION DIVISION.
       PROGRAM-ID.     PTSTI002.


       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. RM-COBOL.
       OBJECT-COMPUTER. RM-COBOL.

       DATA DIVISION.
       FILE SECTION.

       PROCEDURE DIVISION.
       MAIN-LOGIC SECTION.
       BEGIN.
           DISPLAY " " LINE 1.
           DISPLAY "Hello world!" LINE 15.
           STOP RUN.
       MAIN-LOGIC-EXIT.
           EXIT.
