     IDENTIFICATION DIVISION.
       PROGRAM-ID. TEST2.
        DATE-WRITTEN. May 1, 2009.
        DATE-COMPILED.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
        SOURCE-COMPUTER. IBM-AS400.
        OBJECT-COMPUTER. IBM-AS400.
        FILE-CONTROL.
           SELECT DSP1FILE
             ASSIGN TO WORKSTATION-TEST1DSPF
             ORGANIZATION IS TRANSACTION
             ACCESS MODE IS SEQUENTIAL.

           SELECT DSP2FILE
             ASSIGN TO WORKSTATION-TEST1DSPF
             ORGANIZATION IS TRANSACTION
             ACCESS MODE IS SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD DSP1FILE
           LABEL RECORDS ARE STANDARD.
       01 DSP1REC.
         COPY DDS-ALL-FORMATS OF TEST1DSPF.
         05 TEST1DSPF-RECORD PIC X(10).
       FD DSP2FILE
           LABEL RECORDS ARE STANDARD.
       01 DSP2REC.
         COPY DDS-ALL-FORMATS OF TEST1DSPF.
         05 TEST1DSPF-RECORD PIC X(10).
       WORKING-STORAGE SECTION.
       01 W3-GENERAL.
          03 HIFLD         PIC XX.
          03 BYEFLD        PIC XXX.
       PROCEDURE DIVISION.
       MAIN-LINE SECTION.
       0000.
           PERFORM A-INIT.
           PERFORM B-MAIN.
       9999.
           STOP RUN.
       A-INIT SECTION.
       A-100.
           OPEN I-O DSP1FILE.
           OPEN I-O DSP2FILE.
       B-MAIN SECTION.
       B-100.
           WRITE DSP1REC FORMAT IS "TSTREC1".
           READ DSP1FILE.
            DISPLAY FLD1X.
           WRITE DSP2REC FORMAT IS "TSTREC2".
           READ DSP2FILE.
            DISPLAY FLD2X.
