     A***************************************************************
     A* Tabela....: GEXAP01
     A* Descrição.: Ordenação 'ORIGINAL'
     A***************************************************************
     A          R RGAPOX                    PFILE(GEXAP)
     A
     A          K RR
     A          K TREG
     A          K APOL
