     A***************************************************************
     A* Tabela....: GEXAP02
     A* Descrição.: Ordenação 'COPIA'
     A***************************************************************
     A          R RGAPOX                    PFILE(GEXAP)
     A
     A          K CPMOR1
     A          K SEG
     A          K RR
     A          K APOL
